/*************************************************************************************************************
 * 文件名:		wdg.h
 * 功能:		独立看门狗相关
 * 作者:		cp1300@139.com
 * 创建时间:	2013-06-20
 * 最后修改时间:2013-06-20
 * 详细:		独立看狗初始化以及喂狗
*************************************************************************************************************/
#ifndef __WDG_H
#define __WDG_H 
#include "system.h"


void IWDG_Init(u8 prer,u16 rlr);


//喂独立看门狗
#define IWDG_Feed() (IWDG->KR=0XAAAA)

#endif	//__WDG_H




























