/*************************************************************************************************************
 * 文件名:		wdg.c
 * 功能:		独立看门狗相关
 * 作者:		cp1300@139.com
 * 创建时间:	2013-06-20
 * 最后修改时间:2013-06-20
 * 详细:		独立看狗初始化以及喂狗
*************************************************************************************************************/
#include "wdg.h"  	 
#include "system.h"


/*************************************************************************************************************************
* 函数		:	void IWDG_Init(u8 prer,u16 rlr) 
* 功能		:	初始化独立看门狗
* 参数		:	prer:分频数:0~7(只有低3位有效!)分频因子=4*2^prer.但最大值只能是256!
				rlr:重装载寄存器值:低11位有效.
* 返回		:	点阵起始地址指针
* 依赖		:	底层
* 作者		:	cp1300@139.com
* 时间		:	2013-06-20
* 最后修改时间: 2013-06-20
* 说明		: 	时间计算(大概):Tout=((4*2^prer)*rlr)/40 (ms).
*************************************************************************************************************************/
void IWDG_Init(u8 prer,u16 rlr) 
{
	IWDG->KR=0X5555;	//使能对IWDG->PR和IWDG->RLR的写		 										  
  	IWDG->PR=prer;  	//设置分频系数   
  	IWDG->RLR=rlr;  	//从加载寄存器 IWDG->RLR  
	IWDG->KR=0XAAAA;	//reload											   
  	IWDG->KR=0XCCCC;	//使能看门狗	
}





















