/*************************************************************************************************************
 * 文件名:			USERTASK.H
 * 功能:			相关进程
 * 作者:			cp1300@139.com
 * 创建时间:		2014-08-21
 * 最后修改时间:	2014-08-21
 * 详细:			底层相关
*************************************************************************************************************/
#ifndef _USERTASK_H_
#define _USERTASK_H_
#include "system.h"
#include "BOARD.h"



//W5500处理任务
void TaskW5500(void *pdata);

//SOCKET测试任务
void SOCKET_Task(void *pdata);

#endif /*USERTASK*/
